In [1]:
import pandas as pd
import numpy as np

In [2]:
abs_path = 'C:/Users/newChenyingtao/Python_ws/numpy/titanic'

# pandas.core.frame.DataFrame 数据类型
df = pd.read_csv(abs_path + '/test.csv')

# 获取数据属性名
df.columns.tolist()

['PassengerId',
 'Pclass',
 'Name',
 'Sex',
 'Age',
 'SibSp',
 'Parch',
 'Ticket',
 'Fare',
 'Cabin',
 'Embarked']

In [30]:
print(df.tail())
print(df.head())

     PassengerId  Pclass                          Name     Sex   Age  SibSp  \
413         1305       3            Spector, Mr. Woolf    male   NaN      0
414         1306       1  Oliva y Ocana, Dona. Fermina  female  39.0      0
415         1307       3  Saether, Mr. Simon Sivertsen    male  38.5      0
416         1308       3           Ware, Mr. Frederick    male   NaN      0
417         1309       3      Peter, Master. Michael J    male   NaN      1

     Parch              Ticket      Fare Cabin Embarked
413      0           A.5. 3236    8.0500   NaN        S
414      0            PC 17758  108.9000  C105        C
415      0  SOTON/O.Q. 3101262    7.2500   NaN        S
416      0              359309    8.0500   NaN        S
417      1                2668   22.3583   NaN        C
   PassengerId  Pclass                                          Name     Sex  \
0          892       3                              Kelly, Mr. James    male
1          893       3              Wilkes, Mrs. James (Ellen Needs)  female
2          894       2                     Myles, Mr. Thomas Francis    male
3          895       3                              Wirz, Mr. Albert    male
4          896       3  Hirvonen, Mrs. Alexander (Helga E Lindqvist)  female

    Age  SibSp  Parch   Ticket     Fare Cabin Embarked
0  34.5      0      0   330911   7.8292   NaN        Q
1  47.0      1      0   363272   7.0000   NaN        S
2  62.0      0      0   240276   9.6875   NaN        Q
3  27.0      0      0   315154   8.6625   NaN        S
4  22.0      1      1  3101298  12.2875   NaN        S

In [19]:
# pandas 的数据类型
type(df)

pandas.core.frame.DataFrame

In [23]:
# DataFrame 
# 列名
print(df.columns)
print(df.index)

Index(['PassengerId', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp', 'Parch',
       'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')
RangeIndex(start=0, stop=418, step=1)

In [27]:
df.loc[0]

PassengerId                 892
Pclass                        3
Name           Kelly, Mr. James
Sex                        male
Age                        34.5
SibSp                         0
Parch                         0
Ticket                   330911
Fare                     7.8292
Cabin                       NaN
Embarked                      Q
Name: 0, dtype: object

In [28]:
df.loc[2]

PassengerId                          894
Pclass                                 2
Name           Myles, Mr. Thomas Francis
Sex                                 male
Age                                   62
SibSp                                  0
Parch                                  0
Ticket                            240276
Fare                              9.6875
Cabin                                NaN
Embarked                               Q
Name: 2, dtype: object

In [44]:
# 筛选出

ne = df[(df.Age > 30) & (df.Age < 50) & (df.Sex == 'male')]

In [48]:
ne.sort_values(["Age","Name","Pclass"]).head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
399,1291,3,"Conlon, Mr. Thomas Henry",male,31.0,0,0,21332,7.7333,NaN,Q
68,960,1,"Tucker, Mr. Gilbert Milligan Jr",male,31.0,0,0,2543,28.5375,C53,C
145,1037,3,"Vander Planke, Mr. Julius",male,31.0,3,0,345763,18.0000,NaN,S
210,1102,3,"Andersen, Mr. Albert Karvin",male,32.0,0,0,C 4001,22.5250,NaN,S
341,1233,3,"Lundstrom, Mr. Thure Edvin",male,32.0,0,0,350403,7.5792,NaN,S

# 访问

In [53]:
# 按照索引定位
ne.loc[68]

PassengerId                                960
Pclass                                       1
Name           Tucker, Mr. Gilbert Milligan Jr
Sex                                       male
Age                                         31
SibSp                                        0
Parch                                        0
Ticket                                    2543
Fare                                   28.5375
Cabin                                      C53
Embarked                                     C
Name: 68, dtype: object

In [61]:
scores = {
    "数学":[90, 78, 89],
    "英语":[12, 45, 23],
    "姓名":["li", "wang", "ch"]
}
ddf = pd.DataFrame(scores, index=["one", "two", "three"])

# 此时不存在数字索引，不能用数字loc[2]访问
ddf.loc["three"]

数学    89
英语    23
姓名    ch
Name: three, dtype: object

In [64]:
ddf.iloc[2]

数学    89
英语    23
姓名    ch
Name: three, dtype: object

In [70]:
df.ix[1]

D:\ProgramData\Anaconda3\envs\newpy3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

PassengerId                                 893
Pclass                                        3
Name           Wilkes, Mrs. James (Ellen Needs)
Sex                                      female
Age                                          47
SibSp                                         1
Parch                                         0
Ticket                                   363272
Fare                                          7
Cabin                                       NaN
Embarked                                      S
Name: 1, dtype: object

In [75]:
df.loc[:19]

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S
5,897,3,"Svensson, Mr. Johan Cervin",male,14.0,0,0,7538,9.2250,NaN,S
6,898,3,"Connolly, Miss. Kate",female,30.0,0,0,330972,7.6292,NaN,Q
7,899,2,"Caldwell, Mr. Albert Francis",male,26.0,1,1,248738,29.0000,NaN,S
8,900,3,"Abrahim, Mrs. Joseph (Sophie Halaut Easu)",female,18.0,0,0,2657,7.2292,NaN,C
9,901,3,"Davies, Mr. John Samuel",male,21.0,2,0,A/4 48871,24.1500,NaN,S
10,902,3,"Ilieff, Mr. Ylio",male,NaN,0,0,349220,7.8958,NaN,S
11,903,1,"Jones, Mr. Charles Cresson",male,46.0,0,0,694,26.0000,NaN,S
12,904,1,"Snyder, Mrs. John Pillsbury (Nelle Stevenson)",female,23.0,1,0,21228,82.2667,B45,S
13,905,2,"Howard, Mr. Benjamin",male,63.0,1,0,24065,26.0000,NaN,S
14,906,1,"Chaffee, Mrs. Herbert Fuller (Carrie Constance...",female,47.0,1,0,W.E.P. 5734,61.1750,E31,S
15,907,2,"del Carlo, Mrs. Sebastiano (Argenia Genovesi)",female,24.0,1,0,SC/PARIS 2167,27.7208,NaN,C
16,908,2,"Keane, Mr. Daniel",male,35.0,0,0,233734,12.3500,NaN,Q
17,909,3,"Assaf, Mr. Gerios",male,21.0,0,0,2692,7.2250,NaN,C
18,910,3,"Ilmakangas, Miss. Ida Livija",female,27.0,1,0,STON/O2. 3101270,7.9250,NaN,S
19,911,3,"Assaf Khalil, Mrs. Mariana (Miriam"")""",female,45.0,0,0,2696,7.2250,NaN,C

In [78]:
# 转换为数组
df.iloc[:5].Name.values

array(['Kelly, Mr. James', 'Wilkes, Mrs. James (Ellen Needs)',
       'Myles, Mr. Thomas Francis', 'Wirz, Mr. Albert',
       'Hirvonen, Mrs. Alexander (Helga E Lindqvist)'], dtype=object)

In [81]:
# 简单统计
df.Age.value_counts()

24.0    17
21.0    17
22.0    16
30.0    15
18.0    13
        ..
7.0      1
60.5     1
26.5     1
76.0     1
34.5     1
Name: Age, Length: 79, dtype: int64

In [84]:
# 提取多列
new = df[['Age','Name']].head()
new

    Age                                          Name
0  34.5                              Kelly, Mr. James
1  47.0              Wilkes, Mrs. James (Ellen Needs)
2  62.0                     Myles, Mr. Thomas Francis
3  27.0                              Wirz, Mr. Albert
4  22.0  Hirvonen, Mrs. Alexander (Helga E Lindqvist)

In [87]:
new

    Age                                          Name
0  34.5                              Kelly, Mr. James
1  47.0              Wilkes, Mrs. James (Ellen Needs)
2  62.0                     Myles, Mr. Thomas Francis
3  27.0                              Wirz, Mr. Albert
4  22.0  Hirvonen, Mrs. Alexander (Helga E Lindqvist)

In [86]:

def func(score):
    if score >= 80:
        return "优秀"
    elif score >= 70:
        return "良好"
    elif score >= 60:
        return "及格"
    else:
        return "不及格"
    
print(func(67))

及格

### 匿名函数

In [93]:
[i + 100 for i in range(10)]

[100, 101, 102, 103, 104, 105, 106, 107, 108, 109]

In [96]:
def func(x):
    return x + 100
p = lambda x, y: x + y

In [95]:
# map() 会根据提供的函数对指定序列做映射。
# 第一个参数 function 以参数序列中的每一个元素调用 function 函数，返回包含每次 function 函数返回值的新列表。
list(map(lambda x:x+100, range(10)))

[100, 101, 102, 103, 104, 105, 106, 107, 108, 109]

In [92]:
fune = lambda x:print("匿名函数 " ,x)
fune(5)

SyntaxError: invalid syntax (<ipython-input-92-71330eef4fe0>, line 4)

In [ ]:
# applymap 对dataframe中所有数据进行操作
# apply根据多列生成一个新列的操作

In [90]:
new.applymap(lambda x:str(x) + ',').head

<bound method NDFrame.head of      Age                                           Name
0  34.5,                              Kelly, Mr. James,
1  47.0,              Wilkes, Mrs. James (Ellen Needs),
2  62.0,                     Myles, Mr. Thomas Francis,
3  27.0,                              Wirz, Mr. Albert,
4  22.0,  Hirvonen, Mrs. Alexander (Helga E Lindqvist),>

In [106]:
print(new)
print(new.apply(lambda x: x.Age + 1, axis=1))

    Age                                          Name
0  34.5                              Kelly, Mr. James
1  47.0              Wilkes, Mrs. James (Ellen Needs)
2  62.0                     Myles, Mr. Thomas Francis
3  27.0                              Wirz, Mr. Albert
4  22.0  Hirvonen, Mrs. Alexander (Helga E Lindqvist)
0    35.5
1    48.0
2    63.0
3    28.0
4    23.0
dtype: float64